```
 ➜  aws-terraform git:(develop) ✗ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

aws_security_group_rule.test-vpc-subnet-1-pub-2: Refreshing state... [id=sgrule-3704554297]
aws_security_group_rule.default: Refreshing state... [id=sgrule-158782095]
aws_security_group_rule.default-1: Refreshing state... [id=sgrule-2282146223]
aws_security_group_rule.test-vpc-subnet-1-pub-1: Refreshing state... [id=sgrule-1202394707]
aws_security_group_rule.test-vpc-subnet-1-pub: Refreshing state... [id=sgrule-1251505532]
aws_vpc.subnet-1: Refreshing state... [id=vpc-0ced10853e516fc43]
aws_internet_gateway.test-igw: Refreshing state... [id=igw-0c45b4d85de44146c]
aws_subnet.test-vpc-subnet-2-pri: Refreshing state... [id=subnet-0335e8947b6b091db]
aws_subnet.test-vpc-subnet-1-pub: Refreshing state... [id=subnet-06359e08aa3805fb1]
aws_security_group.default: Refreshing state... [id=sg-0f3c47041517ab5ec]
aws_route_table.test-rtb-pri: Refreshing state... [id=rtb-088a1a32ee81d8736]
aws_security_group.test-vpc-subnet-1-pub: Refreshing state... [id=sg-06c1ac3a56932fef8]
aws_route_table.test-rtb-pub: Refreshing state... [id=rtb-0b9421d5bd0da62fb]
aws_instance.app-server: Refreshing state... [id=i-0e9269507f3cb0529]
aws_instance.bastion-server: Refreshing state... [id=i-0a3b6a9077b5fad95]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.app-server must be replaced
-/+ resource "aws_instance" "app-server" {
        ami                          = "ami-09dac16017637391f"
      ~ arn                          = "arn:aws:ec2:ap-northeast-1:095536213803:instance/i-0e9269507f3cb0529" -> (known after apply)
        associate_public_ip_address  = false
        availability_zone            = "ap-northeast-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 1
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
      + host_id                      = (known after apply)
      ~ id                           = "i-0e9269507f3cb0529" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "202101"
        monitoring                   = false
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0834dd94ff1cc6e16" -> (known after apply)
      ~ private_dns                  = "ip-10-0-1-79.ap-northeast-1.compute.internal" -> (known after apply)
        private_ip                   = "10.0.1.79"
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
      ~ subnet_id                    = "subnet-0335e8947b6b091db" -> (known after apply) # forces replacement
        tags                         = {
            "Name" = "app-server-iwasawa"
        }
        tenancy                      = "default"
      ~ volume_tags                  = {} -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0f3c47041517ab5ec",
        ] -> (known after apply)

        credit_specification {
            cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
          ~ device_name           = "/dev/sda1" -> (known after apply)
            encrypted             = false
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-082b800744ec0f18b" -> (known after apply)
            volume_size           = 8
            volume_type           = "gp2"
        }

        timeouts {}
    }

  # aws_instance.bastion-server must be replaced
-/+ resource "aws_instance" "bastion-server" {
        ami                          = "ami-09dac16017637391f"
      ~ arn                          = "arn:aws:ec2:ap-northeast-1:095536213803:instance/i-0a3b6a9077b5fad95" -> (known after apply)
        associate_public_ip_address  = true
        availability_zone            = "ap-northeast-1a"
        cpu_core_count               = 1
        cpu_threads_per_core         = 1
        disable_api_termination      = false
        ebs_optimized                = false
        get_password_data            = false
        hibernation                  = false
      + host_id                      = (known after apply)
      ~ id                           = "i-0a3b6a9077b5fad95" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.micro"
        ipv6_address_count           = 0
        ipv6_addresses               = []
        key_name                     = "202101"
        monitoring                   = false
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0d921db0cfd1c4620" -> (known after apply)
      ~ private_dns                  = "ip-10-0-0-47.ap-northeast-1.compute.internal" -> (known after apply)
        private_ip                   = "10.0.0.47"
      ~ public_dns                   = "ec2-54-95-124-226.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "54.95.124.226" -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true
      ~ subnet_id                    = "subnet-06359e08aa3805fb1" -> (known after apply) # forces replacement
        tags                         = {
            "Name" = "bastion-server-iwasawa"
        }
        tenancy                      = "default"
      ~ volume_tags                  = {} -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-06c1ac3a56932fef8",
          - "sg-0f3c47041517ab5ec",
        ] -> (known after apply)

        credit_specification {
            cpu_credits = "standard"
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

        metadata_options {
            http_endpoint               = "enabled"
            http_put_response_hop_limit = 1
            http_tokens                 = "optional"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
          ~ device_name           = "/dev/sda1" -> (known after apply)
            encrypted             = false
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-07763cba4505f0e4c" -> (known after apply)
            volume_size           = 8
            volume_type           = "gp2"
        }

        timeouts {}
    }

  # aws_internet_gateway.test-igw will be updated in-place
  ~ resource "aws_internet_gateway" "test-igw" {
        arn      = "arn:aws:ec2:ap-northeast-1:095536213803:internet-gateway/igw-0c45b4d85de44146c"
        id       = "igw-0c45b4d85de44146c"
        owner_id = "095536213803"
        tags     = {
            "Name" = "test-igw"
        }
      ~ vpc_id   = "vpc-0ced10853e516fc43" -> (known after apply)
    }

  # aws_route_table.test-rtb-pri must be replaced
-/+ resource "aws_route_table" "test-rtb-pri" {
      ~ id               = "rtb-088a1a32ee81d8736" -> (known after apply)
      ~ owner_id         = "095536213803" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
        route            = []
        tags             = {
            "Name" = "test-rtb-pri"
        }
      ~ vpc_id           = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement
    }

  # aws_route_table.test-rtb-pub must be replaced
-/+ resource "aws_route_table" "test-rtb-pub" {
      ~ id               = "rtb-0b9421d5bd0da62fb" -> (known after apply)
      ~ owner_id         = "095536213803" -> (known after apply)
      ~ propagating_vgws = [] -> (known after apply)
        route            = [
            {
                cidr_block                = "0.0.0.0/0"
                egress_only_gateway_id    = ""
                gateway_id                = "igw-0c45b4d85de44146c"
                instance_id               = ""
                ipv6_cidr_block           = ""
                nat_gateway_id            = ""
                network_interface_id      = ""
                transit_gateway_id        = ""
                vpc_peering_connection_id = ""
            },
        ]
        tags             = {
            "Name" = "test-rtb-pub"
        }
      ~ vpc_id           = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement
    }

  # aws_security_group.default must be replaced
-/+ resource "aws_security_group" "default" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:095536213803:security-group/sg-0f3c47041517ab5ec" -> (known after apply)
        description            = "default VPC security group"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
      ~ id                     = "sg-0f3c47041517ab5ec" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = []
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = true
                to_port          = 0
            },
        ]
        name                   = "default"
      ~ owner_id               = "095536213803" -> (known after apply)
      + revoke_rules_on_delete = false
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement

        timeouts {}
    }

  # aws_security_group.test-vpc-subnet-1-pub must be replaced
-/+ resource "aws_security_group" "test-vpc-subnet-1-pub" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:095536213803:security-group/sg-06c1ac3a56932fef8" -> (known after apply)
        description            = "Allow SSH access from internet"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
      ~ id                     = "sg-06c1ac3a56932fef8" -> (known after apply)
        ingress                = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 22
                ipv6_cidr_blocks = [
                    "::/0",
                ]
                prefix_list_ids  = []
                protocol         = "tcp"
                security_groups  = []
                self             = false
                to_port          = 22
            },
        ]
        name                   = "test-vpc-subnet-1-pub"
      ~ owner_id               = "095536213803" -> (known after apply)
      + revoke_rules_on_delete = false
      - tags                   = {} -> null
      ~ vpc_id                 = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement

        timeouts {}
    }

  # aws_security_group_rule.default will be destroyed
  - resource "aws_security_group_rule" "default" {
      - cidr_blocks              = [] -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-158782095" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-0f3c47041517ab5ec" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-0f3c47041517ab5ec" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.default-1 will be destroyed
  - resource "aws_security_group_rule" "default-1" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-2282146223" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-0f3c47041517ab5ec" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # aws_security_group_rule.test-vpc-subnet-1-pub will be destroyed
  - resource "aws_security_group_rule" "test-vpc-subnet-1-pub" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 22 -> null
      - id                = "sgrule-1251505532" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-06c1ac3a56932fef8" -> null
      - self              = false -> null
      - to_port           = 22 -> null
      - type              = "ingress" -> null
    }

  # aws_security_group_rule.test-vpc-subnet-1-pub-1 will be destroyed
  - resource "aws_security_group_rule" "test-vpc-subnet-1-pub-1" {
      - cidr_blocks       = [] -> null
      - from_port         = 22 -> null
      - id                = "sgrule-1202394707" -> null
      - ipv6_cidr_blocks  = [
          - "::/0",
        ] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-06c1ac3a56932fef8" -> null
      - self              = false -> null
      - to_port           = 22 -> null
      - type              = "ingress" -> null
    }

  # aws_security_group_rule.test-vpc-subnet-1-pub-2 will be destroyed
  - resource "aws_security_group_rule" "test-vpc-subnet-1-pub-2" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 0 -> null
      - id                = "sgrule-3704554297" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-06c1ac3a56932fef8" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # aws_subnet.test-vpc-subnet-1-pub must be replaced
-/+ resource "aws_subnet" "test-vpc-subnet-1-pub" {
      ~ arn                             = "arn:aws:ec2:ap-northeast-1:095536213803:subnet/subnet-06359e08aa3805fb1" -> (known after apply)
        assign_ipv6_address_on_creation = false
        availability_zone               = "ap-northeast-1a"
      ~ availability_zone_id            = "apne1-az4" -> (known after apply)
        cidr_block                      = "10.0.0.0/24"
      ~ id                              = "subnet-06359e08aa3805fb1" -> (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
        map_public_ip_on_launch         = false
      ~ owner_id                        = "095536213803" -> (known after apply)
        tags                            = {
            "Name" = "test-vpc-subnet-1-pub"
        }
      ~ vpc_id                          = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement

        timeouts {}
    }

  # aws_subnet.test-vpc-subnet-2-pri must be replaced
-/+ resource "aws_subnet" "test-vpc-subnet-2-pri" {
      ~ arn                             = "arn:aws:ec2:ap-northeast-1:095536213803:subnet/subnet-0335e8947b6b091db" -> (known after apply)
        assign_ipv6_address_on_creation = false
        availability_zone               = "ap-northeast-1a"
      ~ availability_zone_id            = "apne1-az4" -> (known after apply)
        cidr_block                      = "10.0.1.0/24"
      ~ id                              = "subnet-0335e8947b6b091db" -> (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
        map_public_ip_on_launch         = false
      ~ owner_id                        = "095536213803" -> (known after apply)
        tags                            = {
            "Name" = "test-vpc-subnet-2-pri"
        }
      ~ vpc_id                          = "vpc-0ced10853e516fc43" -> (known after apply) # forces replacement

        timeouts {}
    }

  # aws_vpc.subnet-1 will be destroyed
  - resource "aws_vpc" "subnet-1" {
      - arn                              = "arn:aws:ec2:ap-northeast-1:095536213803:vpc/vpc-0ced10853e516fc43" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-0b7d07aa4c17f5dc4" -> null
      - default_route_table_id           = "rtb-088a1a32ee81d8736" -> null
      - default_security_group_id        = "sg-0f3c47041517ab5ec" -> null
      - dhcp_options_id                  = "dopt-3a61505d" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0ced10853e516fc43" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-088a1a32ee81d8736" -> null
      - owner_id                         = "095536213803" -> null
      - tags                             = {
          - "Name" = "test-vpc"
        } -> null
    }

  # aws_vpc.test-vpc will be created
  + resource "aws_vpc" "test-vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "test-vpc"
        }
    }

Plan: 9 to add, 1 to change, 14 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

 ➜  aws-terraform git:(develop) ✗
 ➜  aws-terraform git:(develop) ✗
 ➜  aws-terraform git:(develop) ✗
 ➜  aws-terraform git:(develop) ✗

```